// Абстракция - придание объекту характеристик, которые отличают его от всех других объектов, четко определяя его концептуальные границы.
// Инкапсуляция - можно скрыть ненужные внутренние подробности работы объекта от окружающего мира (алгоритмы работы с данными хранятся вместе с данными)
// Наследование - можно создавать специализированные классы на основе базовых (позволяет избегать написания повторного кода).
// Полиморфизм - в разных объектах одна и та же операция может выполнять различные функции.
// Композиция - объект может быть составным и включать в себя другие объекты.
// 