// Основные принципы ООП:

// * Абстракция - придание объекту каких-либо отлчительных характеристик (свойств, методов), которые определяют его концептуальные границы и отличают его от других объектов.

// * Инкапсуляция -
// 1) Сокрытие данных, реализации методов от внешнего мира.
// 2) Методы объекта должны находится вместе с данными, которые используются в этом объекте.

// * Наследование - концепция основанная на том, что от Базового объекта может наследоваться объект(наследник), при этом наследуя какие-то свйоства и методы этого Базового обекта.

// * Полиморфизм - один и тот же метод объекта может выполнять разные действия. В зависимости от того, какой это объект.

// * Композиция - концепция, которая подразумевает собой, что объект может быть составным и включать в себя другие объекты.
